good-bites-backend/app/controllers/categories_controller.rb

    def set_category
        category = Category.find_by_id(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]