good-bites-backend/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        category = Category.find_by_id(params[:id])

INSERT INTO "categories" ("group", "created_at", "updated_at") VALUES (?, ?, ?)  [["group", "delivery"], ["created_at", "2020-06-10 03:17:42.208955"], ["updated_at", "2020-06-10 03:17:42.208955"]]
---
    def create
        category = Category.create(category_params)