good-bites-backend/app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_restaurant
        restaurant = Restaurant.find_by_id(params[:id])